Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeUnConnError Property
 The selected fitting(s) cannot successfully change the type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartCannotChangeTypeUnConnError { get; }
Public Shared ReadOnly Property FabricationPartCannotChangeTypeUnConnError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeUnConnError {
	FailureDefinitionId^ get ();
}
static member FabricationPartCannotChangeTypeUnConnError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace